In [1]:
# data analysis and wrangling
import pandas as pd
import numpy as np
import random as rnd

# visualization
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# machine learning
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

In [2]:
train_df = pd.read_csv("/kaggle/input/titanic/train.csv")
test_df = pd.read_csv("/kaggle/input/titanic/test.csv")
combine = [train_df, test_df]

In [3]:
for dataset in combine:
    dataset['Title'] = dataset.Name.str.extract(' ([A-Za-z]+)\.', expand=False)

pd.crosstab(train_df['Title'], train_df['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     2
Countess       1     0
Don            0     1
Dr             1     6
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    40
Miss         182     0
Mlle           2     0
Mme            1     0
Mr             0   517
Mrs          125     0
Ms             1     0
Rev            0     6
Sir            0     1

In [4]:
for dataset in combine:
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
 	'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')

    dataset['Title'] = dataset['Title'].replace('Mlle', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Ms', 'Miss')
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')
    
train_df[['Title', 'Survived']].groupby(['Title'], as_index=False).mean()

    Title  Survived
0  Master  0.575000
1    Miss  0.702703
2      Mr  0.156673
3     Mrs  0.793651
4    Rare  0.347826

In [5]:
title_mapping = {"Mr": 1, "Miss": 2, "Mrs": 3, "Master": 4, "Rare": 5}
for dataset in combine:
    dataset['Title'] = dataset['Title'].map(title_mapping)
    dataset['Title'] = dataset['Title'].fillna(0)

train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [6]:
train_df = train_df.drop(['Name', 'PassengerId'], axis=1)
test_df = test_df.drop(['Name'], axis=1)
train_df = train_df.drop(['Ticket', 'Cabin'], axis=1)
test_df = test_df.drop(['Ticket', 'Cabin'], axis=1)
combine = [train_df, test_df]
train_df.shape, test_df.shape

((891, 9), (418, 9))

In [7]:
for dataset in combine:
    dataset['Sex'] = dataset['Sex'].map( {'female': 1, 'male': 0} ).astype(int)

train_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Title
0         0       3    0  22.0      1      0   7.2500        S      1
1         1       1    1  38.0      1      0  71.2833        C      3
2         1       3    1  26.0      0      0   7.9250        S      2
3         1       1    1  35.0      1      0  53.1000        S      3
4         0       3    0  35.0      0      0   8.0500        S      1

In [8]:
train_df['AgeBand'] = pd.cut(train_df['Age'], 5)
train_df[['AgeBand', 'Survived']].groupby(['AgeBand'], as_index=False).mean().sort_values(by='AgeBand', ascending=True)

            AgeBand  Survived
0    (0.34, 16.336]  0.550000
1  (16.336, 32.252]  0.369942
2  (32.252, 48.168]  0.404255
3  (48.168, 64.084]  0.434783
4    (64.084, 80.0]  0.090909

In [9]:
for dataset in combine:    
    dataset.loc[ dataset['Age'] <= 16, 'Age'] = 0
    dataset.loc[(dataset['Age'] > 16) & (dataset['Age'] <= 25), 'Age'] = 1
    dataset.loc[(dataset['Age'] > 25) & (dataset['Age'] <= 32), 'Age'] = 2
    dataset.loc[(dataset['Age'] > 32) & (dataset['Age'] <= 48), 'Age'] = 3
    dataset.loc[(dataset['Age'] > 48) & (dataset['Age'] <= 64), 'Age'] = 4
    dataset.loc[ dataset['Age'] > 64, 'Age'] = 5
train_df.head(30)

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Title,AgeBand
0,0,3,0,1.0,1,0,7.2500,S,1,"(16.336, 32.252]"
1,1,1,1,3.0,1,0,71.2833,C,3,"(32.252, 48.168]"
2,1,3,1,2.0,0,0,7.9250,S,2,"(16.336, 32.252]"
3,1,1,1,3.0,1,0,53.1000,S,3,"(32.252, 48.168]"
4,0,3,0,3.0,0,0,8.0500,S,1,"(32.252, 48.168]"
5,0,3,0,NaN,0,0,8.4583,Q,1,NaN
6,0,1,0,4.0,0,0,51.8625,S,1,"(48.168, 64.084]"
7,0,3,0,0.0,3,1,21.0750,S,4,"(0.34, 16.336]"
8,1,3,1,2.0,0,2,11.1333,S,3,"(16.336, 32.252]"
9,1,2,1,0.0,1,0,30.0708,C,3,"(0.34, 16.336]"
10,1,3,1,0.0,1,1,16.7000,S,2,"(0.34, 16.336]"
11,1,1,1,4.0,0,0,26.5500,S,2,"(48.168, 64.084]"
12,0,3,0,1.0,0,0,8.0500,S,1,"(16.336, 32.252]"
13,0,3,0,3.0,1,5,31.2750,S,1,"(32.252, 48.168]"
14,0,3,1,0.0,0,0,7.8542,S,2,"(0.34, 16.336]"
15,1,2,1,4.0,0,0,16.0000,S,3,"(48.168, 64.084]"
16,0,3,0,0.0,4,1,29.1250,Q,4,"(0.34, 16.336]"
17,1,2,0,NaN,0,0,13.0000,S,1,NaN
18,0,3,1,2.0,1,0,18.0000,S,3,"(16.336, 32.252]"
19,1,3,1,NaN,0,0,7.2250,C,3,NaN
20,0,2,0,3.0,0,0,26.0000,S,1,"(32.252, 48.168]"
21,1,2,0,3.0,0,0,13.0000,S,1,"(32.252, 48.168]"
22,1,3,1,0.0,0,0,8.0292,Q,2,"(0.34, 16.336]"
23,1,1,0,2.0,0,0,35.5000,S,1,"(16.336, 32.252]"
24,0,3,1,0.0,3,1,21.0750,S,2,"(0.34, 16.336]"
25,1,3,1,3.0,1,5,31.3875,S,3,"(32.252, 48.168]"
26,0,3,0,NaN,0,0,7.2250,C,1,NaN
27,0,1,0,1.0,3,2,263.0000,S,1,"(16.336, 32.252]"
28,1,3,1,NaN,0,0,7.8792,Q,2,NaN
29,0,3,0,NaN,0,0,7.8958,S,1,NaN

In [10]:
train_df = train_df.drop(['AgeBand'], axis=1)
combine = [train_df, test_df]

In [11]:
for dataset in combine:
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1

train_df[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index=False).mean().sort_values(by='Survived', ascending=False)

   FamilySize  Survived
3           4  0.724138
2           3  0.578431
1           2  0.552795
6           7  0.333333
0           1  0.303538
4           5  0.200000
5           6  0.136364
7           8  0.000000
8          11  0.000000

In [12]:
for dataset in combine:
    dataset['IsAlone'] = 0
    dataset.loc[dataset['FamilySize'] == 1, 'IsAlone'] = 1

train_df[['IsAlone', 'Survived']].groupby(['IsAlone'], as_index=False).mean()

   IsAlone  Survived
0        0  0.505650
1        1  0.303538

In [13]:
train_df = train_df.drop(['Parch', 'SibSp', 'FamilySize'], axis=1)
test_df = test_df.drop(['Parch', 'SibSp', 'FamilySize'], axis=1)
combine = [train_df, test_df]

train_df.head()

   Survived  Pclass  Sex  Age     Fare Embarked  Title  IsAlone
0         0       3    0  1.0   7.2500        S      1        0
1         1       1    1  3.0  71.2833        C      3        0
2         1       3    1  2.0   7.9250        S      2        1
3         1       1    1  3.0  53.1000        S      3        0
4         0       3    0  3.0   8.0500        S      1        1

In [14]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].fillna('S')
    
train_df[['Embarked', 'Survived']].groupby(['Embarked'], as_index=False).mean().sort_values(by='Survived', ascending=False)

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [15]:
for dataset in combine:
    dataset['Embarked'] = dataset['Embarked'].map( {'S': 0, 'C': 1, 'Q': 2} ).astype(int)

train_df.head()

   Survived  Pclass  Sex  Age     Fare  Embarked  Title  IsAlone
0         0       3    0  1.0   7.2500         0      1        0
1         1       1    1  3.0  71.2833         1      3        0
2         1       3    1  2.0   7.9250         0      2        1
3         1       1    1  3.0  53.1000         0      3        0
4         0       3    0  3.0   8.0500         0      1        1

In [16]:
test_df['Fare'].fillna(test_df['Fare'].dropna().median(), inplace=True)
test_df.head()

   PassengerId  Pclass  Sex  Age     Fare  Embarked  Title  IsAlone
0          892       3    0  3.0   7.8292         2      1        1
1          893       3    1  3.0   7.0000         0      3        0
2          894       2    0  4.0   9.6875         2      1        1
3          895       3    0  2.0   8.6625         0      1        1
4          896       3    1  1.0  12.2875         0      3        0

In [17]:
train_df['FareBand'] = pd.qcut(train_df['Fare'], 4)
train_df[['FareBand', 'Survived']].groupby(['FareBand'], as_index=False).mean().sort_values(by='FareBand', ascending=True)

          FareBand  Survived
0   (-0.001, 7.91]  0.197309
1   (7.91, 14.454]  0.303571
2   (14.454, 31.0]  0.454955
3  (31.0, 512.329]  0.581081

In [18]:
for dataset in combine:
    dataset.loc[ dataset['Fare'] <= 7.91, 'Fare'] = 0
    dataset.loc[(dataset['Fare'] > 7.91) & (dataset['Fare'] <= 14.454), 'Fare'] = 1
    dataset.loc[(dataset['Fare'] > 14.454) & (dataset['Fare'] <= 31), 'Fare']   = 2
    dataset.loc[ dataset['Fare'] > 31, 'Fare'] = 3
    dataset['Fare'] = dataset['Fare'].astype(int)

train_df = train_df.drop(['FareBand'], axis=1)
combine = [train_df, test_df]
    
train_df.head(10)

   Survived  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone
0         0       3    0  1.0     0         0      1        0
1         1       1    1  3.0     3         1      3        0
2         1       3    1  2.0     1         0      2        1
3         1       1    1  3.0     3         0      3        0
4         0       3    0  3.0     1         0      1        1
5         0       3    0  NaN     1         2      1        1
6         0       1    0  4.0     3         0      1        1
7         0       3    0  0.0     2         0      4        0
8         1       3    1  2.0     1         0      3        0
9         1       2    1  0.0     2         1      3        0

In [19]:
train_df.info()
print('_'*40)
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int64
Age         714 non-null float64
Fare        891 non-null int64
Embarked    891 non-null int64
Title       891 non-null int64
IsAlone     891 non-null int64
dtypes: float64(1), int64(7)
memory usage: 55.8 KB
________________________________________
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Sex            418 non-null int64
Age            332 non-null float64
Fare           418 non-null int64
Embarked       418 non-null int64
Title          418 non-null int64
IsAlone        418 non-null int64
dtypes: float64(1), int64(7)
memory usage: 26.2 KB

In [20]:
train_df['Age']

0      1.0
1      3.0
2      2.0
3      3.0
4      3.0
      ...
886    2.0
887    1.0
888    NaN
889    2.0
890    2.0
Name: Age, Length: 891, dtype: float64

In [21]:
for dataset in combine:    
    dataset.loc[( dataset['Title'] == 1) , 'Age'] = dataset["Age"].fillna(1)
    dataset.loc[( dataset['Title'] == 2) , 'Age'] = dataset["Age"].fillna(1)
    dataset.loc[( dataset['Title'] == 3) , 'Age'] = dataset["Age"].fillna(2)
    dataset.loc[ (dataset['Title'] == 4) , 'Age'] = dataset["Age"].fillna(0)
    dataset.loc[ (dataset['Title'] == 5) , 'Age'] = dataset["Age"].fillna(3)
train_df.head(20)

    Survived  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone
0          0       3    0  1.0     0         0      1        0
1          1       1    1  3.0     3         1      3        0
2          1       3    1  2.0     1         0      2        1
3          1       1    1  3.0     3         0      3        0
4          0       3    0  3.0     1         0      1        1
5          0       3    0  1.0     1         2      1        1
6          0       1    0  4.0     3         0      1        1
7          0       3    0  0.0     2         0      4        0
8          1       3    1  2.0     1         0      3        0
9          1       2    1  0.0     2         1      3        0
10         1       3    1  0.0     2         0      2        0
11         1       1    1  4.0     2         0      2        1
12         0       3    0  1.0     1         0      1        1
13         0       3    0  3.0     3         0      1        0
14         0       3    1  0.0     0         0      2        1
15         1       2    1  4.0     2         0      3        1
16         0       3    0  0.0     2         2      4        0
17         1       2    0  1.0     1         0      1        1
18         0       3    1  2.0     2         0      3        0
19         1       3    1  2.0     0         1      3        1

In [22]:
test_df.head(20)

    PassengerId  Pclass  Sex  Age  Fare  Embarked  Title  IsAlone
0           892       3    0  3.0     0         2      1        1
1           893       3    1  3.0     0         0      3        0
2           894       2    0  4.0     1         2      1        1
3           895       3    0  2.0     1         0      1        1
4           896       3    1  1.0     1         0      3        0
5           897       3    0  0.0     1         0      1        1
6           898       3    1  2.0     0         2      2        1
7           899       2    0  2.0     2         0      1        0
8           900       3    1  1.0     0         1      3        1
9           901       3    0  1.0     2         0      1        0
10          902       3    0  1.0     0         0      1        1
11          903       1    0  3.0     2         0      1        1
12          904       1    1  1.0     3         0      3        0
13          905       2    0  4.0     2         0      1        0
14          906       1    1  3.0     3         0      3        0
15          907       2    1  1.0     2         1      3        0
16          908       2    0  3.0     1         2      1        1
17          909       3    0  1.0     0         1      1        1
18          910       3    1  2.0     1         0      2        0
19          911       3    1  3.0     0         1      3        1

In [23]:
train_df.info()
print('_'*40)
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int64
Age         891 non-null float64
Fare        891 non-null int64
Embarked    891 non-null int64
Title       891 non-null int64
IsAlone     891 non-null int64
dtypes: float64(1), int64(7)
memory usage: 55.8 KB
________________________________________
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 8 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Sex            418 non-null int64
Age            418 non-null float64
Fare           418 non-null int64
Embarked       418 non-null int64
Title          418 non-null int64
IsAlone        418 non-null int64
dtypes: float64(1), int64(7)
memory usage: 26.2 KB

In [24]:
X_train = train_df.drop("Survived", axis=1)
Y_train = train_df["Survived"]
X_test  = test_df.drop("PassengerId", axis=1).copy()
X_train.shape, Y_train.shape, X_test.shape

((891, 7), (891,), (418, 7))

In [25]:
random_forest = RandomForestClassifier(n_estimators=100)
random_forest.fit(X_train, Y_train)
Y_pred = random_forest.predict(X_test)
random_forest.score(X_train, Y_train)
acc_random_forest = round(random_forest.score(X_train, Y_train) * 100, 2)
acc_random_forest

87.99

In [26]:
submission = pd.DataFrame({
        "PassengerId": test_df["PassengerId"],
        "Survived": Y_pred })
submission.to_csv('my_submission.csv', index=False)